#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=820379311794]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_task_definition.service will be created
  + resource "aws_ecs_task_definition" "service" {
      + arn                   = (known after apply)
      + arn_without_revision  = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + cpu          = 10
                  + essential    = true
                  + image        = "node:latest"
                  + memory       = 512
                  + name         = "demo"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + family                = "service"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + skip_destroy          = false
      + tags                  = {
          + "yor_trace" = "522dc9a4-4747-48f5-9bdb-7b94b4c5d3bf"
        }
      + tags_all              = {
          + "yor_trace" = "522dc9a4-4747-48f5-9bdb-7b94b4c5d3bf"
        }
    }

  # aws_s3_bucket.perthdemo will be created
  + resource "aws_s3_bucket" "perthdemo" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "820379311794-acme-dev-perth-demo"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "820379311794-acme-dev"
          + "Name"        = "820379311794-acme-dev-perth-demo"
          + "customer"    = "Perth-IaC-Demo1-update-11062024"
          + "git_org"     = "davesc63"
          + "git_repo"    = "Prisma-Cloud-IaC-Demo"
          + "newTag"      = "dave"
          + "usecase"     = "misconfiguration"
          + "yor_trace"   = "522dc9a4-AAAA-BBBB-CCCC-7b94b4c5d3bf"
        }
      + tags_all                    = {
          + "Environment" = "820379311794-acme-dev"
          + "Name"        = "820379311794-acme-dev-perth-demo"
          + "customer"    = "Perth-IaC-Demo1-update-11062024"
          + "git_org"     = "davesc63"
          + "git_repo"    = "Prisma-Cloud-IaC-Demo"
          + "newTag"      = "dave"
          + "usecase"     = "misconfiguration"
          + "yor_trace"   = "522dc9a4-AAAA-BBBB-CCCC-7b94b4c5d3bf"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_security_group.bad-sg will be created
  + resource "aws_security_group" "bad-sg" {
      + arn                    = (known after apply)
      + description            = "Prisma-IAC-Demo - bad-sg Misconfigured Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "bad-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "customer"  = "Demo-Customer-Name-Here"
          + "git_org"   = "davesc63"
          + "git_repo"  = "Prisma-Cloud-IaC-Demo"
          + "yor_trace" = "4003b87d-8532-47f0-8dcc-938fb4c94c53"
        }
      + tags_all               = {
          + "customer"  = "Demo-Customer-Name-Here"
          + "git_org"   = "davesc63"
          + "git_repo"  = "Prisma-Cloud-IaC-Demo"
          + "yor_trace" = "4003b87d-8532-47f0-8dcc-938fb4c94c53"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.drift-sg will be created
  + resource "aws_security_group" "drift-sg" {
      + arn                    = (known after apply)
      + description            = "Prisma-IAC-Demo - SG with drift from IaC"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "drift-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "customer"  = "Demo-Customer-Name-Here"
          + "git_org"   = "davesc63"
          + "git_repo"  = "Prisma-Cloud-IaC-Demo"
          + "usecase"   = "drift"
          + "yor_trace" = "522dc9a4-6666-7777-9bdb-7b94b4c5d3bf"
        }
      + tags_all               = {
          + "customer"  = "Demo-Customer-Name-Here"
          + "git_org"   = "davesc63"
          + "git_repo"  = "Prisma-Cloud-IaC-Demo"
          + "usecase"   = "drift"
          + "yor_trace" = "522dc9a4-6666-7777-9bdb-7b94b4c5d3bf"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.web-node will be created
  + resource "aws_security_group" "web-node" {
      + arn                    = (known after apply)
      + description            = "Prisma-IAC-Demo - Misconfigured Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "bad-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "customer"  = "Demo-Customer-Name-Here"
          + "git_org"   = "davesc63"
          + "git_repo"  = "Prisma-Cloud-IaC-Demo"
          + "yor_trace" = "86352312-9b96-40f4-aa50-5c1b25c44e37"
        }
      + tags_all               = {
          + "customer"  = "Demo-Customer-Name-Here"
          + "git_org"   = "davesc63"
          + "git_repo"  = "Prisma-Cloud-IaC-Demo"
          + "yor_trace" = "86352312-9b96-40f4-aa50-5c1b25c44e37"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @davesc63, Action: `pull_request`*